EDT/УТ/src/Documents/мгПодработкаНаСкладе/мгПодработкаНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгПодработкаНаСкладе</name>
  <comment>(Миго-групп)</comment>
  <registerRecords>AccumulationRegister.мгЗарплатаНачисления</registerRecords>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Начисления</name>
    <comment>(Миго-групп)</comment>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодработкаНаСкладе</name>
    <attributes>
      <name>ДатаПодработки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОСотрудника</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/мгЗарплатаНачисления/мгЗарплатаНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мгЗарплатаНачисления</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/мгПодработкаНаСкладе/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр мгЗарплатаНачисления Приход
	Движения.мгЗарплатаНачисления.Записать();
	Движения.мгЗарплатаНачисления.Записывать = Истина;
	Движения.мгЗарплатаНачисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мгПодработкаНаСкладеПодработкаНаСкладе.Организация КАК Организация,
		|	мгПодработкаНаСкладеПодработкаНаСкладе.ФИОСотрудника КАК ФИОСотрудника,
		|	мгПодработкаНаСкладеПодработкаНаСкладе.ДатаПодработки КАК ДатаПодработки,
		|	мгПодработкаНаСкладеПодработкаНаСкладе.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ вт_мгПодработкаНаСкладе
		|ИЗ
		|	Документ.мгПодработкаНаСкладе.ПодработкаНаСкладе КАК мгПодработкаНаСкладеПодработкаНаСкладе
		|ГДЕ
		|	мгПодработкаНаСкладеПодработкаНаСкладе.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_мгПодработкаНаСкладе.Организация КАК Организация,
		|	вт_мгПодработкаНаСкладе.ФИОСотрудника КАК ФИОСотрудника,
		|	вт_мгПодработкаНаСкладе.ДатаПодработки КАК ДатаПодработки,
		|	вт_мгПодработкаНаСкладе.НомерСтроки КАК НомерСтроки,
		|	мгЗарплатаНачисления.Регистратор КАК Регистратор
		|ИЗ
		|	вт_мгПодработкаНаСкладе КАК вт_мгПодработкаНаСкладе
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.мгЗарплатаНачисления КАК мгЗарплатаНачисления
		|		ПО вт_мгПодработкаНаСкладе.Организация = мгЗарплатаНачисления.Организация
		|			И вт_мгПодработкаНаСкладе.ФИОСотрудника = мгЗарплатаНачисления.Сотрудник
		|			И вт_мгПодработкаНаСкладе.ДатаПодработки = мгЗарплатаНачисления.Период
		|			И (ЗНАЧЕНИЕ(Справочник.мгНачисленияУдержания.ПодработкаНаСкладе) = мгЗарплатаНачисления.ВидНачисления)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса 		= Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Регистратор) Тогда
			
			Отказ		= Истина;
			Сообщение 	= Новый СообщениеПользователю();
		    Сообщение.Текст = "Номер строки " + ВыборкаДетальныеЗаписи.НомерСтроки +  ". Сотрудник " + """" + ВыборкаДетальныеЗаписи.ФИОСотрудника + """" + " уже зарегистрирован на " + Формат(ВыборкаДетальныеЗаписи.ДатаПодработки,"ДФ=dd.MM.yyyy") + " документом:" + ВыборкаДетальныеЗаписи.Регистратор ;
		    Сообщение.Поле = "ПодработкаНаСкладе["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].ДатаПодработки";
		    Сообщение.УстановитьДанные(ЭтотОбъект);
		    Сообщение.Сообщить();
	
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;	
		КонецЕсли; 
		
		Движение 				= Движения.мгЗарплатаНачисления.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		
		Движение.Период 		= НачалоДня(ВыборкаДетальныеЗаписи.ДатаПодработки);
		Движение.Организация 	= ВыборкаДетальныеЗаписи.Организация;
		Движение.Сотрудник 		= ВыборкаДетальныеЗаписи.ФИОСотрудника;
		Движение.Терминал 		= Терминал;
		Движение.ВидНачисления 	= ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ПодработкаНаСкладе");
		Движение.Тариф 			= Тариф;
		
	КонецЦикла;

	
	
КонецПроцедуры
